user_input = int(input())
for i in range(user_input, user_input + 3):
    print(i)

# Сумма трёх чисел
'''
Формат входных данных
На вход программе подаётся три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести сумму введенных чисел.
'''
a = int(input())
b = int(input())
c = int(input())

print(a + b + c)