user_input = int(input())
for i in range(user_input, user_input + 3):
    print(i)

# Сумма трёх чисел
'''
Формат входных данных
На вход программе подаётся три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести сумму введенных чисел.

'''
a = int(input())
b = int(input())
c = int(input())

print(a + b + c)

''' 
Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

Формат входных данных
На вход программе подается одно целое число – длина ребра.

Формат выходных данных
Программа должна вывести текст и числа в соответствии с условием задачи.

Примечание. Объём куба и площадь полной поверхности можно вычислить по формулам 


 '''